In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [3]:
avocado_df = pd.read_csv('Resources/clean_avocado.csv')
income_df = pd.read_csv('Resources/clean_income_data.csv')
age_df = pd.read_csv('Resources/clean_age_data.csv')

In [4]:
avocado_df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,"Albany, NY"
1,1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,"Albany, NY"
2,2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,"Albany, NY"
3,3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,"Albany, NY"
4,4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,"Albany, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14755,14755,11/4/2018,1.49,8300.71,152.99,521.23,0.00,7626.49,6953.34,673.15,0.0,organic,2018,"Tampa, FL"
14756,14756,11/11/2018,1.54,9113.31,136.55,670.58,0.00,8306.18,7048.18,1258.00,0.0,organic,2018,"Tampa, FL"
14757,14757,11/18/2018,1.52,12259.52,220.91,1231.73,0.00,10806.88,7333.34,3473.54,0.0,organic,2018,"Tampa, FL"
14758,14758,11/25/2018,1.24,710.36,52.13,25.74,0.00,632.49,567.77,64.72,0.0,organic,2018,"Tampa, FL"
14759,14759,12/2/2018,1.29,7374.15,176.32,5.44,0.00,7192.39,7192.39,0.00,0.0,organic,2018,"Tampa, FL"

In [5]:
income_df

      Unnamed: 0  Year                                City  Household Income
0              0  2018                Albany City PUMA, NY             47121
1              1  2018  Los Angeles-Long Beach-Anaheim, CA             69138
2              2  2018                       United States             60293
3              3  2018         Albany-Schenectady-Troy, NY             68651
4              4  2018                     Los Angeles, CA             58385
...          ...   ...                                 ...               ...
8995        8995  2015  Los Angeles-Long Beach-Anaheim, CA             62544
8996        8996  2015              Los Angeles County, CA             59134
8997        8997  2015                     Los Angeles, CA             52024
8998        8998  2015                             Florida             49426
8999        8999  2015                          California             64500

[9000 rows x 4 columns]

In [6]:
age_df

       Unnamed: 0  Year        City        Age Range  Number in Range
0               0  2018  Albany, NY   18 to 24 Years            21091
1               1  2018  Albany, NY  75 Years & Over             5906
2               2  2018  Albany, NY   45 to 54 Years            10514
3               3  2018  Albany, NY    Under 5 Years             5491
4               4  2018  Albany, NY   65 to 74 Years             6670
...           ...   ...         ...              ...              ...
10819       10819  2015   Tampa, FL    Under 5 Years            22686
10820       10820  2015   Tampa, FL    5 to 17 Years            57889
10821       10821  2015   Tampa, FL   45 to 54 Years            50313
10822       10822  2015   Tampa, FL   62 to 64 Years            10131
10823       10823  2015   Tampa, FL   65 to 74 Years            25388

[10824 rows x 5 columns]

In [7]:
age_df = pd.DataFrame(age_df[['Year', 'City', 'Age Range', 'Number in Range']])
age_df

       Year        City        Age Range  Number in Range
0      2018  Albany, NY   18 to 24 Years            21091
1      2018  Albany, NY  75 Years & Over             5906
2      2018  Albany, NY   45 to 54 Years            10514
3      2018  Albany, NY    Under 5 Years             5491
4      2018  Albany, NY   65 to 74 Years             6670
...     ...         ...              ...              ...
10819  2015   Tampa, FL    Under 5 Years            22686
10820  2015   Tampa, FL    5 to 17 Years            57889
10821  2015   Tampa, FL   45 to 54 Years            50313
10822  2015   Tampa, FL   62 to 64 Years            10131
10823  2015   Tampa, FL   65 to 74 Years            25388

[10824 rows x 4 columns]

In [8]:
income_df = pd.DataFrame(income_df[['Year', 'City', 'Household Income']])
income_df

      Year                                City  Household Income
0     2018                Albany City PUMA, NY             47121
1     2018  Los Angeles-Long Beach-Anaheim, CA             69138
2     2018                       United States             60293
3     2018         Albany-Schenectady-Troy, NY             68651
4     2018                     Los Angeles, CA             58385
...    ...                                 ...               ...
8995  2015  Los Angeles-Long Beach-Anaheim, CA             62544
8996  2015              Los Angeles County, CA             59134
8997  2015                     Los Angeles, CA             52024
8998  2015                             Florida             49426
8999  2015                          California             64500

[9000 rows x 3 columns]

In [9]:
avocado_df = pd.DataFrame(avocado_df[['Date','AveragePrice', 'Total Volume', '4046', '4225', '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year', 'region']])

In [10]:
income_df.to_csv('Resources/clean_income_data.csv', index=False)
age_df.to_csv('Resources/clean_age_data.csv', index= False)
avocado_df.to_csv('Resources/clean_avocado.csv', index= False)